[
    {
        "name": "SberDevices",
        "from": "01-01-2024",
        "to": "05-04-2024",
        "description": "It was basically my first job on a team, a big team. All sorts of scrum, agile, kanban boards appeared. Lots of all sorts of managers and such. But all the guys on the programming team were cool. Initially I was on one project doing a text to video translation interface, but I didn't really like him and he didn't like me either. So after a while I was transferred to a related project that was more interesting to me. In fact, there were the same guys around, the same team leader. But the project was different, it was an information booth with a virtual persona. we did it together with another person, also a front-end developer. We divided the project into areas of responsibility and each person did his own. We reviewed each other's code, so that everyone knew what was going on in the other part of the project. We also helped each other if one of us didn't have time to do important tasks. So I was mainly involved in integration with maps and navigation. And also the product search module. And I've been trying to launch this project on wearable devices. To be able to open it through the existing ecosystem on a phone or other device. In general, it was not a priority, so it was done when I had time. But partial success was still achieved. But all good things come to an end, so due to the world situation at the time, many projects were frozen. There was a reorganization of teams, some projects were taken over by other people. So I ended up in a new project, and by new I mean brand new. I was trusted to do it from scratch myself. I wouldn't say it was complicated. But the plans for it were interesting. And so we managed to make only a landing page with all sorts of beautiful animations and transitions. After that this project was also frozen because of disagreements with copyright holders. Already here I seriously began to think about leaving. But I still found a place on some internal project. And here again I was left all alone as a frontend developer. I don't know if they thought I couldn't work in a team. I kind of agree with that, I'm more comfortable working alone. There was nothing interesting in this project, just an admin panel to manage internal entities. So the thought of leaving was getting closer and closer. So I decided to start learning new things, specifically data analytics and machine learning. It was good that they offered me an internship in the machine vision team. I gladly accepted this offer and began to delve into their tasks and try to do something. Parallel to that, I allocated about half of my time to the frontend, since the tasks there have not gone anywhere. But not for long I was able to do it, after a couple of months I looked back and realized that I had no special successes either there or here. So I decided to concentrate on learning to analyze data. And I left that place."
    },
    {
        "name": "FacePass",
        "from": "01-04-2024",
        "to": "01-04-2024",
        "description": "The guys are developing an access control system, I came here to replace an old fronted developer. I don't know why he left. But in the end I was alone in developing the admin for the ACS and the terminal at the company's entrance. It was mainly interaction with the backend developer, rewriting the old API to the new one. Refactoring and adding components. I think here I implemented a notification system via websockets and slightly improved site performance by adding virtualization for the table with data. The rest was just boring stuff. About the terminal, it was written on an old version of react, used class components and had confusing code, there were problems with transitions between states and screens. So I managed to convince the others to rewrite the system from scratch using suitable patterns. In the end I managed to implement a basic version of this terminal and after that it was time for new adventures. A friend of mine offered to go to Moscow with him. He had some kind of job offer there. And I was working remotely, so I easily agreed. With a new city came the desire to move somewhere and develop so I began to look for a new job and began to give very little time to the current one. Thankfully there were not so many tasks besides the realization of the new terminal. After searching for some time I found a new place, which seemed very attractive to me. And having handed over the current tasks to the new person I moved on."
    },
    {
        "name": "MegaCount",
        "from": "01-04-2024",
        "to": "01-04-2024",
        "description": "This company was engaged in the development of systems for tracking visitors, and keeping statistics on the path they traveled. I joined it right after my internship, and it happened to be where I met Fronted. Although initially I wanted to develop hardware. Here I was allowed to work on them only after six months. But first I had to learn JavaScript and React. I had to make some components and fix bugs. I remember one of my first components was a component for displaying camera output. In this component you could move, rotate and scale images from different devices. Then I made some interface for customer service checkout and wrapped it in electron and made it so that the system could not terminate this process. It wasn't that interesting so I don't remember very well. And only after that I could start to familiarize myself with hardware development. The first and unfortunately the last project here was the entrance gate of the visitor counter. It was cool, I led this development almost entirely on my own. My senior mentor only occasionally helped with things like transistors, resistors and other circuit components. Other than that, I was trusted to work on this project on my own. <This will be the schematic for the entrance gate>. After a few months of learning and working on this. The project was almost finished and was going through the final debugging stage. But some shit happened, one fine morning I came to work hoping to finish the project but my computer couldn't turn on. I tried for a long time to do something, but it turned out that the hard disk had failed, the same disk that had all the project code on it. I honestly don't know why we didn't use repositories to store code back then. In the end there were only a few working devices with old firmware left. And I was offered to write the firmware again, and at first I even agreed. But in the end I couldn't do the same thing over and over again, because it was incredibly boring. And in the end I left that job. Now I always use Git. In fact, it still makes me sad when I think about it."
    },
    {
        "name": "Eksit",
        "from": "01-04-2024",
        "to": "01-04-2024",
        "description": "It was essentially a university-based job, though not mine, but a neighboring university. In this team we were developing VR simulators for industrial enterprises, on safety, evacuation, pipeline repair, and controlling systems for opening gates and all sorts of things. Again, I originally wanted to develop these simulators, but so far there was only room and tasks for a fullstack developer. So I started a system for keeping statistics on the use of these simulators. It was quite primitive, since the simulators were written in Unity I made a small library for this engine, calling methods of which simulator developers sent requests with data to the server of statistics collection. And then this statistics was shown to the client application in Vue. I wasn't really interested, so I don't even remember if I finished it or not, but we collected some statistics. <Put scheme in there.> In the end, a friend of mine suggested that I go to work with him and they were just looking for a mobile app developer. So I went to work with him."
    },
    {
        "name": "Abacus",
        "from": "01-04-2024",
        "to": "01-04-2024",
        "description": "It was a small startup, or rather to say a very small project with only two people in charge of development, my friend who was originally here and now me who came to develop the mobile application. As I said, I was responsible for the mobile application. It was a simple application, it connected to the scales that my friend had developed via bluetooth and displayed the weight that they were transmitting. You could save the weight, set a reference point, enter data about the load. Initially there was no specific plan for the functionality of the application, some functions suddenly appeared in the head of the person in charge. And the stage of their realization began. So documents, photos, schedules, and much more were added. The most interesting thing was to deal with the module of license plate recognition, according to the idea there was a camera at the entrance to the scales and it was necessary to automatically recognize and record every car entering. I had to deal with python, which I always treated with some distrust, and machine learning, which I had only heard about once. So I found some open source model, got some data with car numbers and trained my first model, it didn't work perfectly, but it was quite acceptable. I still had to give the operator the opportunity to edit the license plate number manually. But it was still not bad. <Scheme here>. It ended when my friend decided to move on, so he stopped developing the embeded part of the project. No one came to take his place, and I decided to change the project too."
    }
]